# LAB-1
**Sapozhnikov, Boryaev**

## ReadMe
* All tasks are made using SQLite3 and Python
* Such decision has been made for convenient representation of work in one scrolled page with table of contents
* Python is used only for sending SQL requests and making iterated insert utility 
* All SQL requests are in multi-line strings

# Python settings

In [ ]:
import sqlite3
from tabulate import tabulate as tb

In [ ]:
SQL_connection = sqlite3.connect('medical_info', check_same_thread=False)
SQL_coursor = SQL_connection.cursor()

In [ ]:
def get_table_columns(table_name=''):
  if table_name != '':
    SQL_connection.cursor().execute(f"SELECT * FROM {table_name}")
  return [description[0] for description in SQL_coursor.description]

# Level 1

## Tasks 1-3

In [ ]:
SQL_coursor.execute(
      '''
      CREATE TABLE IF NOT EXISTS MedPersons(
      id INTEGER PRIMARY KEY,
      last_name TEXT NOT NULL,
      adress TEXT NOT NULL,
      taxes REAL NOT NULL)
      ''')

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT * FROM MedPersons
    ''').fetchall()
print(tb(result))

In [ ]:
get_table_columns('MedPersons')

['id', 'last_name', 'adress', 'taxes']

In [ ]:
def insert_values(table_name: str, values: tuple):
  if (len(values) <= 0):
    print("ERROR: few values")
    return
  values_str = ""
  for value in values:
    values_str += str(value) + ','
  sql_string = f"INSERT INTO {table_name} VALUES ({values_str[:-1]})"
  print(sql_string)
  SQL_coursor.execute(sql_string)

def insert_multiple_values(table_name: str, values_list: list):
  for values in values_list:
    insert_values(table_name, values)

In [ ]:
data = [(1, "'Медина'", "'Вознесенское'", 14),
        (2, "'Севастьянов'", "'Навашино'", 14),
        (3, "'Бессонов'", "'Выкса'", 10),
        (4, "'Губанов'", "'Выкса'", 10),
        (5, "'Боева'", "'Починки'", 5)]
insert_multiple_values('MedPersons', data)

INSERT INTO MedPersons VALUES (1,'Медина','Вознесенское',14)
INSERT INTO MedPersons VALUES (2,'Севастьянов','Навашино',14)
INSERT INTO MedPersons VALUES (3,'Бессонов','Выкса',10)
INSERT INTO MedPersons VALUES (4,'Губанов','Выкса',10)
INSERT INTO MedPersons VALUES (5,'Боева','Починки',5)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT * FROM MedPersons
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  id  last_name    adress          taxes
----  -----------  ------------  -------
   1  Медина       Вознесенское       14
   2  Севастьянов  Навашино           14
   3  Бессонов     Выкса              10
   4  Губанов      Выкса              10
   5  Боева        Починки             5

In [ ]:
SQL_coursor.execute(
      '''
      CREATE TABLE IF NOT EXISTS WorkPlace(
      id INTEGER PRIMARY KEY,
      institution TEXT NOT NULL,
      adress TEXT NOT NULL,
      budget_deduction REAL NOT NULL)
      ''')

In [ ]:
data = [(1, "'Районная больница'", "'Вознесенское'", 10),
        (2, "'Травм. пункт'", "'Выкса'", 3),
        (3, "'Больница'", "'Навашино'", 4),
        (4, "'Род. дом'", "'Вознесенское'", 12),
        (5, "'Больница'", "'Починки'", 4),
        (6, "'Травм.пункт'", "'Лукояново'", 3)]
insert_multiple_values('WorkPlace', data)

INSERT INTO WorkPlace VALUES (1,'Районная больница','Вознесенское',10)
INSERT INTO WorkPlace VALUES (2,'Травм. пункт','Выкса',3)
INSERT INTO WorkPlace VALUES (3,'Больница','Навашино',4)
INSERT INTO WorkPlace VALUES (4,'Род. дом','Вознесенское',12)
INSERT INTO WorkPlace VALUES (5,'Больница','Починки',4)
INSERT INTO WorkPlace VALUES (6,'Травм.пункт','Лукояново',3)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT * FROM WorkPlace
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  id  institution        adress          budget_deduction
----  -----------------  ------------  ------------------
   1  Районная больница  Вознесенское                  10
   2  Травм. пункт       Выкса                          3
   3  Больница           Навашино                       4
   4  Род. дом           Вознесенское                  12
   5  Больница           Починки                        4
   6  Травм.пункт        Лукояново                      3

In [ ]:
SQL_coursor.execute(
      '''
      CREATE TABLE IF NOT EXISTS OperationTypes(
      id INTEGER PRIMARY KEY,
      name TEXT NOT NULL,
      town TEXT NOT NULL,
      amount INT NOT NULL,
      price REAL NOT NULL)
      ''')

In [ ]:
data = [(1, "'Наложение гипса'", "'Выкса'", 2000, 18000),
        (2, "'Блокада'", "'Навашино'", 10000, 14000),
        (3, "'Инъекция поливитаминов'", "'Навашино'", 20000, 11000),
        (4, "'Инъекция алоэ'", "'Навашино'", 12000,	11000),
        (5, "'ЭКГ'", "'Вознесенское'", 115,	10000),
        (6, "'УЗИ'", "'Вознесенское'", 20, 30000),
        (7, "'Флюорография'", "'Выкса'", 1000,	5000)]

insert_multiple_values('OperationTypes', data)

INSERT INTO OperationTypes VALUES (1,'Наложение гипса','Выкса',2000,18000)
INSERT INTO OperationTypes VALUES (2,'Блокада','Навашино',10000,14000)
INSERT INTO OperationTypes VALUES (3,'Инъекция поливитаминов','Навашино',20000,11000)
INSERT INTO OperationTypes VALUES (4,'Инъекция алоэ','Навашино',12000,11000)
INSERT INTO OperationTypes VALUES (5,'ЭКГ','Вознесенское',115,10000)
INSERT INTO OperationTypes VALUES (6,'УЗИ','Вознесенское',20,30000)
INSERT INTO OperationTypes VALUES (7,'Флюорография','Выкса',1000,5000)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT * FROM OperationTypes
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  id  name                    town            amount    price
----  ----------------------  ------------  --------  -------
   1  Наложение гипса         Выкса             2000    18000
   2  Блокада                 Навашино         10000    14000
   3  Инъекция поливитаминов  Навашино         20000    11000
   4  Инъекция алоэ           Навашино         12000    11000
   5  ЭКГ                     Вознесенское       115    10000
   6  УЗИ                     Вознесенское        20    30000
   7  Флюорография            Выкса             1000     5000

In [ ]:
SQL_coursor.execute(
      '''
      CREATE TABLE IF NOT EXISTS LaborActivity(
      id INTEGER PRIMARY KEY,
      date TEXT NOT NULL,
      med_person INT NOT NULL,
      work_place INT NOT NULL,
      operation_type INT NOT NULL,
      amount INT NOT NULL,
      salary REAL NOT NULL,
      FOREIGN KEY (med_person) REFERENCES MedPersons(id),
      FOREIGN KEY (work_place) REFERENCES WorkPlace(id),
      FOREIGN KEY (operation_type) REFERENCES OperationTypes(id))
      ''')

In [ ]:
data = [(51040, "'Понедельник'", 1, 1, 7,	4, 20000),
        (51041, "'Понедельник'", 3, 3, 6,	1, 30000),
        (51042, "'Понедельник'", 4, 3, 4,	3, 33000),
        (51043, "'Понедельник'", 4, 5, 1,	2, 36000),
        (51044, "'Понедельник'", 4, 4, 6,	1, 30000),
        (51045, "'Среда'", 2, 2, 5,	3, 30000),
        (51046, "'Четверг'", 3, 6, 4,	4, 44000),
        (51047, "'Четверг'", 4, 6, 2,	1, 28000),
        (51048, "'Четверг'", 5, 3, 3,	4, 44000),
        (51049, "'Пятница'", 2, 4, 5, 1, 10000),
        (51050, "'Пятница'", 3, 6, 4, 2, 22000),
        (51051, "'Пятница'", 3, 3, 1, 2, 36000),
        (51052, "'Пятница'", 5, 3, 2, 1, 14000),
        (51053, "'Суббота'", 3, 2, 7, 2, 10000),
        (51054, "'Суббота'", 4, 6, 4, 1, 11000),
        (51055, "'Суббота'", 5, 5, 4, 2, 22000),
        (51056, "'Суббота'", 3, 6, 3, 2, 22000)]

insert_multiple_values('LaborActivity', data)

INSERT INTO LaborActivity VALUES (51040,'Понедельник',1,1,7,4,20000)
INSERT INTO LaborActivity VALUES (51041,'Понедельник',3,3,6,1,30000)
INSERT INTO LaborActivity VALUES (51042,'Понедельник',4,3,4,3,33000)
INSERT INTO LaborActivity VALUES (51043,'Понедельник',4,5,1,2,36000)
INSERT INTO LaborActivity VALUES (51044,'Понедельник',4,4,6,1,30000)
INSERT INTO LaborActivity VALUES (51045,'Среда',2,2,5,3,30000)
INSERT INTO LaborActivity VALUES (51046,'Четверг',3,6,4,4,44000)
INSERT INTO LaborActivity VALUES (51047,'Четверг',4,6,2,1,28000)
INSERT INTO LaborActivity VALUES (51048,'Четверг',5,3,3,4,44000)
INSERT INTO LaborActivity VALUES (51049,'Пятница',2,4,5,1,10000)
INSERT INTO LaborActivity VALUES (51050,'Пятница',3,6,4,2,22000)
INSERT INTO LaborActivity VALUES (51051,'Пятница',3,3,1,2,36000)
INSERT INTO LaborActivity VALUES (51052,'Пятница',5,3,2,1,14000)
INSERT INTO LaborActivity VALUES (51053,'Суббота',3,2,7,2,10000)
INSERT INTO LaborActivity VALUES (51054,'Суббота',4,6,4,1,11000)
INSERT INTO LaborActivity VALUES (51055,'Суббота',5,5,4,2,22000)
INSERT INTO LaborActivity VALUES (51056,'Суббота',3,6,3,2,22000)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT * FROM LaborActivity
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

   id  date           med_person    work_place    operation_type    amount    salary
-----  -----------  ------------  ------------  ----------------  --------  --------
51040  Понедельник             1             1                 7         4     20000
51041  Понедельник             3             3                 6         1     30000
51042  Понедельник             4             3                 4         3     33000
51043  Понедельник             4             5                 1         2     36000
51044  Понедельник             4             4                 6         1     30000
51045  Среда                   2             2                 5         3     30000
51046  Четверг                 3             6                 4         4     44000
51047  Четверг                 4             6                 2         1     28000
51048  Четверг                 5             3                 3         4     44000
51049  Пятница                 2             4                 5         1     10000
51050  Пятница                 3             6                 4         2     22000
51051  Пятница                 3             3                 1         2     36000
51052  Пятница                 5             3                 2         1     14000
51053  Суббота                 3             2                 7         2     10000
51054  Суббота                 4             6                 4         1     11000
51055  Суббота                 5             5                 4         2     22000
51056  Суббота                 3             6                 3         2     22000

## Task 4

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT adress FROM MedPersons
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

adress
------------
Вознесенское
Навашино
Выкса
Починки

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT institution FROM WorkPlace
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

institution
-----------------
Районная больница
Травм. пункт
Больница
Род. дом
Травм.пункт

c)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT date FROM LaborActivity
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

date
-----------
Понедельник
Среда
Четверг
Пятница
Суббота

## Taks 5

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT date, id FROM LaborActivity
    WHERE salary >= 14000
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

date            id
-----------  -----
Понедельник  51040
Понедельник  51041
Понедельник  51042
Понедельник  51043
Понедельник  51044
Среда        51045
Четверг      51046
Четверг      51047
Четверг      51048
Пятница      51050
Пятница      51051
Пятница      51052
Суббота      51055
Суббота      51056

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT taxes, adress FROM MedPersons
    WHERE adress IN ('Выкса', 'Навашино');
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  taxes  adress
-------  --------
     14  Навашино
     10  Выкса

c)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT name, price, town FROM OperationTypes
    WHERE price > 10000 AND name LIKE '%Инъекция%'
    ORDER BY town, price
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

name                      price  town
----------------------  -------  --------
Инъекция поливитаминов    11000  Навашино
Инъекция алоэ             11000  Навашино

## Task 6

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT date, MedPersons.last_name, WorkPlace.institution, OperationTypes.name
    FROM LaborActivity
    JOIN MedPersons ON med_person == MedPersons.id
    JOIN WorkPlace ON work_place == WorkPlace.id
    JOIN OperationTypes ON operation_type == OperationTypes.id
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

date         last_name    institution        name
-----------  -----------  -----------------  ----------------------
Понедельник  Медина       Районная больница  Флюорография
Понедельник  Бессонов     Больница           УЗИ
Понедельник  Губанов      Больница           Инъекция алоэ
Понедельник  Губанов      Больница           Наложение гипса
Понедельник  Губанов      Род. дом           УЗИ
Среда        Севастьянов  Травм. пункт       ЭКГ
Четверг      Бессонов     Травм.пункт        Инъекция алоэ
Четверг      Губанов      Травм.пункт        Блокада
Четверг      Боева        Больница           Инъекция поливитаминов
Пятница      Севастьянов  Род. дом           ЭКГ
Пятница      Бессонов     Травм.пункт        Инъекция алоэ
Пятница      Бессонов     Больница           Наложение гипса
Пятница      Боева        Больница           Блокада
Суббота      Бессонов     Травм. пункт       Флюорография
Суббота      Губанов      Травм.пункт        Инъекция алоэ
Суббота      Боева        Больница           Инъекция алоэ
Суббота      Бессонов     Травм.пункт        Инъекция поливитаминов

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT LaborActivity.id, WorkPlace.institution, amount, salary
    FROM LaborActivity
    JOIN WorkPlace ON work_place == WorkPlace.id
    ORDER BY salary
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

   id  institution          amount    salary
-----  -----------------  --------  --------
51049  Род. дом                  1     10000
51053  Травм. пункт              2     10000
51054  Травм.пункт               1     11000
51052  Больница                  1     14000
51040  Районная больница         4     20000
51050  Травм.пункт               2     22000
51055  Больница                  2     22000
51056  Травм.пункт               2     22000
51047  Травм.пункт               1     28000
51041  Больница                  1     30000
51044  Род. дом                  1     30000
51045  Травм. пункт              3     30000
51042  Больница                  3     33000
51043  Больница                  2     36000
51051  Больница                  2     36000
51046  Травм.пункт               4     44000
51048  Больница                  4     44000

## Task 7

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT MedPersons.last_name, MedPersons.adress
    FROM LaborActivity
    JOIN MedPersons ON med_person == MedPersons.id
    JOIN WorkPlace ON work_place == WorkPlace.id
    WHERE operation_type == 1 AND amount > 1
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

last_name    adress
-----------  --------
Губанов      Выкса
Бессонов     Выкса

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT OperationTypes.name
    FROM LaborActivity
    JOIN MedPersons ON med_person == MedPersons.id
    JOIN WorkPlace ON work_place == WorkPlace.id
    JOIN OperationTypes ON operation_type == OperationTypes.id
    WHERE MedPersons.adress IN ('Вознесенское', 'Выкса')
          AND (WorkPlace.institution LIKE '%Больница%' 
            OR WorkPlace.institution LIKE '%больница%')
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

name
---------------
Флюорография
УЗИ
Инъекция алоэ
Наложение гипса

с)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT WorkPlace.institution, WorkPlace.budget_deduction, 
                    MedPersons.last_name
    FROM LaborActivity
    JOIN MedPersons ON med_person == MedPersons.id
    JOIN WorkPlace ON work_place == WorkPlace.id
    WHERE MedPersons.taxes BETWEEN 7 AND 16
    ORDER BY WorkPlace.budget_deduction, MedPersons.taxes
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

institution          budget_deduction  last_name
-----------------  ------------------  -----------
Травм.пункт                         3  Бессонов
Травм.пункт                         3  Губанов
Травм. пункт                        3  Бессонов
Травм. пункт                        3  Севастьянов
Больница                            4  Бессонов
Больница                            4  Губанов
Районная больница                  10  Медина
Род. дом                           12  Губанов
Род. дом                           12  Севастьянов

d)

In [133]:
result = SQL_coursor.execute(
    '''
    SELECT date, operation_type, MedPersons.last_name
    FROM LaborActivity
    JOIN MedPersons ON med_person == MedPersons.id
    JOIN OperationTypes ON operation_type == OperationTypes.id
    WHERE price >= 7000 AND LaborActivity.amount > 1
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

date           operation_type  last_name
-----------  ----------------  -----------
Понедельник                 4  Губанов
Понедельник                 1  Губанов
Среда                       5  Севастьянов
Четверг                     4  Бессонов
Четверг                     3  Боева
Пятница                     4  Бессонов
Пятница                     1  Бессонов
Суббота                     4  Боева
Суббота                     3  Бессонов

## Task 8

In [ ]:
result = SQL_coursor.execute(
    '''
    UPDATE LaborActivity
    SET salary = (SELECT salary * (1 - taxes / 100)
                  FROM MedPersons
                  WHERE med_person = MedPersons.id) 
    ''').fetchall()
result = SQL_coursor.execute("SELECT * FROM LaborActivity")
print(tb(result, headers=get_table_columns()))

   id  date           med_person    work_place    operation_type    amount    salary
-----  -----------  ------------  ------------  ----------------  --------  --------
51040  Понедельник             1             1                 7         4     17200
51041  Понедельник             3             3                 6         1     27000
51042  Понедельник             4             3                 4         3     29700
51043  Понедельник             4             5                 1         2     32400
51044  Понедельник             4             4                 6         1     27000
51045  Среда                   2             2                 5         3     25800
51046  Четверг                 3             6                 4         4     39600
51047  Четверг                 4             6                 2         1     25200
51048  Четверг                 5             3                 3         4     41800
51049  Пятница                 2             4                 5         1      8600
51050  Пятница                 3             6                 4         2     19800
51051  Пятница                 3             3                 1         2     32400
51052  Пятница                 5             3                 2         1     13300
51053  Суббота                 3             2                 7         2      9000
51054  Суббота                 4             6                 4         1      9900
51055  Суббота                 5             5                 4         2     20900
51056  Суббота                 3             6                 3         2     19800

## Task 9

In [ ]:
SQL_coursor.execute("ALTER TABLE LaborActivity ADD COLUMN budget_deduction")
SQL_coursor.execute(
    '''
    UPDATE LaborActivity
    SET budget_deduction = (SELECT WorkPlace.budget_deduction
                            FROM WorkPlace
                            WHERE work_place = WorkPlace.id) 
    ''')
result = SQL_coursor.execute("SELECT * FROM LaborActivity")
print(tb(result, headers=get_table_columns()))

   id  date           med_person    work_place    operation_type    amount    salary    budget_deduction
-----  -----------  ------------  ------------  ----------------  --------  --------  ------------------
51040  Понедельник             1             1                 7         4     17200                  10
51041  Понедельник             3             3                 6         1     27000                   4
51042  Понедельник             4             3                 4         3     29700                   4
51043  Понедельник             4             5                 1         2     32400                   4
51044  Понедельник             4             4                 6         1     27000                  12
51045  Среда                   2             2                 5         3     25800                   3
51046  Четверг                 3             6                 4         4     39600                   3
51047  Четверг                 4             6                 2         1     25200                   3
51048  Четверг                 5             3                 3         4     41800                   4
51049  Пятница                 2             4                 5         1      8600                  12
51050  Пятница                 3             6                 4         2     19800                   3
51051  Пятница                 3             3                 1         2     32400                   4
51052  Пятница                 5             3                 2         1     13300                   4
51053  Суббота                 3             2                 7         2      9000                   3
51054  Суббота                 4             6                 4         1      9900                   3
51055  Суббота                 5             5                 4         2     20900                   4
51056  Суббота                 3             6                 3         2     19800                   3

# Level 2

## Task 10

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT last_name FROM MedPersons
    WHERE adress == 'Навашино' 
    AND 
    id IN (SELECT med_person FROM LaborActivity
           JOIN OperationTypes ON operation_type == OperationTypes.id
           JOIN WorkPlace ON work_place == WorkPlace.id
           WHERE (OperationTypes.name LIKE '%инъекция%'
                  OR OperationTypes.name LIKE '%Инъекция%')
           AND WorkPlace.adress == 'Выкса')
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

last_name
-----------

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT operation_type FROM LaborActivity
    WHERE date IN ('Понедельник','Вторник')
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  operation_type
----------------
               7
               6
               4
               1

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT OperationTypes.name FROM OperationTypes
    JOIN LaborActivity ON OperationTypes.id == LaborActivity.operation_type
    WHERE OperationTypes.id NOT IN (SELECT DISTINCT operation_type FROM LaborActivity
                                    WHERE date IN ('Понедельник','Вторник'))
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

name
----------------------
ЭКГ
Блокада
Инъекция поливитаминов

c)

In [128]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT WorkPlace.institution, WorkPlace.budget_deduction, MedPersons.last_name
    FROM LaborActivity
    JOIN WorkPlace ON WorkPlace.id == LaborActivity.work_place
    JOIN MedPersons ON MedPersons.id == LaborActivity.med_person
    WHERE LaborActivity.med_person IN (SELECT id FROM MedPersons
                                       WHERE taxes BETWEEN 7 AND 16)
    ORDER BY WorkPlace.budget_deduction
    ''').fetchall()
print("7c")
print(tb(result, headers=get_table_columns()))

7c
institution          budget_deduction  last_name
-----------------  ------------------  -----------
Травм. пункт                        3  Севастьянов
Травм.пункт                         3  Бессонов
Травм.пункт                         3  Губанов
Травм. пункт                        3  Бессонов
Больница                            4  Бессонов
Больница                            4  Губанов
Районная больница                  10  Медина
Род. дом                           12  Губанов
Род. дом                           12  Севастьянов

In [130]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT date, operation_type, MedPersons.last_name
    FROM LaborActivity
    JOIN MedPersons ON MedPersons.id == LaborActivity.med_person
    WHERE amount > 1
    AND operation_type IN (SELECT OperationTypes.id FROM OperationTypes
                           WHERE price >= 7000)
    ''').fetchall()
print("7d")
print(tb(result, headers=get_table_columns()))

7d
date           operation_type  last_name
-----------  ----------------  -----------
Понедельник                 4  Губанов
Понедельник                 1  Губанов
Среда                       5  Севастьянов
Четверг                     4  Бессонов
Четверг                     3  Боева
Пятница                     4  Бессонов
Пятница                     1  Бессонов
Суббота                     4  Боева
Суббота                     3  Бессонов

## Task 11

**NOTE**: Cannot be executed because SQLite3 has no 'ANY', 'ALL' operators

a)

In [ ]:
# result = SQL_coursor.execute(
#     '''
#     SELECT institution FROM WorkPlace
#     WHERE budget_deduction <= ALL (SELECT budget_deduction
#                                    FROM WorkPlace)
#     ''').fetchall()

b)

In [ ]:
# result = SQL_coursor.execute(
#     '''
#     SELECT last_name FROM MedPersons
#     JOIN LaborActivity ON MedPersons.id = LaborActivity.med_personal
#     WHERE LaborActivity.salary <= ALL (SELECT salary
#                                        FROM LaborActivity)
#     ''').fetchall()

c)

In [ ]:
# result = SQL_coursor.execute(
#     '''
#     SELECT name, price FROM OperationTypes
#     WHERE OperationTypes.price >= ALL (SELECT price
#                                        FROM OperationTypes
#                                        JOIN LaborActivity ON 
#                                        OperationTypes.id = LaborActivity.operation_type
#                                        WHERE LaborActivity.date IN ('Четверг', 'Пятница'))
#     ''').fetchall()

d)

In [ ]:
# result = SQL_coursor.execute(
#     '''
#     SELECT last_name, adress FROM MedPersons
#     WHERE id = ANY (SELECT med_person FROM LaborActivity
#                     WHERE operation_type = 1 AND amount > 1)
#     ''').fetchall()

## Task 12

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT adress FROM MedPersons
    UNION 
    SELECT town FROM OperationTypes
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

adress
------------
Вознесенское
Выкса
Навашино
Починки

##Task 13

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT med_person AS mp_id
    FROM LaborActivity
    WHERE NOT EXISTS (SELECT med_person FROM LaborActivity
                      WHERE date = 'Суббота' AND mp_id = med_person)
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  mp_id
-------
      1
      2

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT operation_type as opt_id
    FROM LaborActivity
    WHERE NOT EXISTS (SELECT DISTINCT med_person 
                      FROM LaborActivity
                      JOIN WorkPlace ON work_place = WorkPlace.id
                      WHERE WorkPlace.adress = 'Выкса'

                      EXCEPT

                      SELECT med_person FROM LaborActivity
                      WHERE operation_type = opt_id)
    ORDER BY opt_id
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

opt_id
--------

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT med_person 
    FROM LaborActivity
    JOIN WorkPlace ON work_place = WorkPlace.id
    WHERE WorkPlace.adress = 'Выкса'
    ''').fetchall()
print("Все врачи, которые работают в Выксе:")
print(tb(result, headers=get_table_columns()))

Все врачи, которые работают в Выксе:
  med_person
------------
           2
           3

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT operation_type FROM LaborActivity
    WHERE med_person = 2
    ''').fetchall()
print("Операции, которые делал 2й врач:")
print(tb(result, headers=get_table_columns()))
#
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT operation_type FROM LaborActivity
    WHERE med_person = 3
    ''').fetchall()
print("Операции, которые делал 3й врач:")
print(tb(result, headers=get_table_columns()))

Операции, которые делал 2й врач:
  operation_type
----------------
               5
Операции, которые делал 3й врач:
  operation_type
----------------
               6
               4
               1
               7
               3

**Вывод**: так как нам надо найти операцию, которую делали оба врача из Выксы,  
то необходимо, чтобы 2й врач сделал одну из операций в списке 3го или наоборот

c)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT work_place as wp_id
    FROM LaborActivity
    WHERE NOT EXISTS (SELECT work_place FROM LaborActivity
                      WHERE operation_type = 6
                      AND amount > 1
                      AND work_place = wp_id)
    ORDER BY wp_id
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  wp_id
-------
      1
      2
      3
      4
      5
      6

d)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT work_place as wp_id
    FROM LaborActivity
    WHERE NOT EXISTS (SELECT DISTINCT med_person 
                      FROM LaborActivity
                      WHERE work_place = wp_id

                      EXCEPT

                      SELECT med_person FROM LaborActivity
                      JOIN MedPersons ON med_person = MedPersons.id
                      JOIN WorkPlace ON work_place = WorkPlace.id
                      WHERE WorkPlace.adress != MedPersons.adress
                      AND work_place = wp_id)
    ORDER BY wp_id
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  wp_id
-------
      3
      4
      6

## Task 14

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT COUNT(DISTINCT work_place) AS unique_work_places_num
    FROM LaborActivity
    WHERE med_person IN (SELECT DISTINCT med_person 
                         FROM LaborActivity
                         JOIN WorkPlace ON work_place = WorkPlace.id
                         WHERE WorkPlace.adress = 'Выкса')
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  unique_work_places_num
------------------------
                       4

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT DISTINCT med_person, taxes
    FROM LaborActivity
    JOIN OperationTypes ON operation_type = OperationTypes.id
    JOIN MedPersons ON med_person = MedPersons.id
    WHERE (OperationTypes.name LIKE '%инъекция%'
          OR OperationTypes.name LIKE '%Инъекция%')
    ''').fetchall()
print("Врачи, делающие инъекции, и их налоги:")
print(tb(result, headers=get_table_columns()))

Врачи, делающие инъекции, и их налоги:
  med_person    taxes
------------  -------
           4       10
           3       10
           5        5

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT AVG(taxes)
    FROM (SELECT DISTINCT med_person, taxes
          FROM LaborActivity
          JOIN OperationTypes ON operation_type = OperationTypes.id
          JOIN MedPersons ON med_person = MedPersons.id
          WHERE (OperationTypes.name LIKE '%инъекция%'
                OR OperationTypes.name LIKE '%Инъекция%'))
    ''').fetchall()
print("Средний налог таких врачей:")
print(tb(result, headers=get_table_columns()))

Средний налог таких врачей:
  AVG(taxes)
------------
     8.33333

с)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT med_person
    FROM (SELECT MIN(OperationTypes.price), LaborActivity.med_person
          FROM LaborActivity
          JOIN OperationTypes ON operation_type = OperationTypes.id)
    ''').fetchall()
print("Самый дешевый врач :D")
print(tb(result, headers=get_table_columns()))

Самый дешевый врач :D
  med_person
------------
           1

d)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT operation_type
    FROM LaborActivity
    JOIN OperationTypes ON operation_type = OperationTypes.id
    JOIN MedPersons ON med_person = MedPersons.id
    WHERE date = 'Понедельник' 
    AND MedPersons.last_name = 'Губанов'
    AND OperationTypes.price <= 15000
    ''').fetchall()
print("Операции не дороже 15к, которые делал Губанов в Понедельник")
print(tb(result, headers=get_table_columns()))

Операции не дороже 15к, которые делал Губанов в Понедельник
  operation_type
----------------
               4

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT SUM(amount) AS amount
    FROM (SELECT LaborActivity.amount
          FROM LaborActivity
          JOIN OperationTypes ON operation_type = OperationTypes.id
          JOIN MedPersons ON med_person = MedPersons.id
          WHERE date = 'Понедельник' 
          AND MedPersons.last_name = 'Губанов'
          AND OperationTypes.price <= 15000)
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  amount
--------
       3

## Task 15

a)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT date, operation_type, SUM(amount) AS amount
    FROM LaborActivity
    GROUP BY date, operation_type
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

date           operation_type    amount
-----------  ----------------  --------
Понедельник                 1         2
Понедельник                 4         3
Понедельник                 6         2
Понедельник                 7         4
Пятница                     1         2
Пятница                     2         1
Пятница                     4         2
Пятница                     5         1
Среда                       5         3
Суббота                     3         2
Суббота                     4         3
Суббота                     7         2
Четверг                     2         1
Четверг                     3         4
Четверг                     4         4

b)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT med_person, AVG(OperationTypes.price) AS average_price
    FROM LaborActivity
    JOIN OperationTypes ON operation_type = OperationTypes.id
    GROUP BY med_person
    ''').fetchall()
print("Если считать средннюю стоимость операций, без учета их количества (по типу операций):")
print(tb(result, headers=get_table_columns()))

Если считать средннюю стоимость операций, без учета их количества (по типу операций):
  med_person    average_price
------------  ---------------
           1           5000
           2          10000
           3          14333.3
           4          16800
           5          12000

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT med_person, 
    (SUM(OperationTypes.price * LaborActivity.amount) / SUM(LaborActivity.amount)) AS average_price
    FROM LaborActivity
    JOIN OperationTypes ON operation_type = OperationTypes.id
    GROUP BY med_person
    ''').fetchall()
print("Если считать средннюю стоимость всех операций, проведенных врачом:")
print(tb(result, headers=get_table_columns()))

Если считать средннюю стоимость всех операций, проведенных врачом:
  med_person    average_price
------------  ---------------
           1           5000
           2          10000
           3          12615.4
           4          15500
           5          11428.6

**NOTE**: мы не могли использовать поле 'LaborActivity.salary' , так как ранее вычли от туда налоги

c)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT work_place, 
    SUM(OperationTypes.price * LaborActivity.amount) AS sum
    FROM LaborActivity
    JOIN OperationTypes ON operation_type = OperationTypes.id
    GROUP BY work_place
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  work_place     sum
------------  ------
           1   20000
           2   40000
           3  157000
           4   40000
           5   58000
           6  113000

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT work_place
    FROM (SELECT work_place, 
          SUM(OperationTypes.price * LaborActivity.amount) AS sum
          FROM LaborActivity
          JOIN OperationTypes ON operation_type = OperationTypes.id
          GROUP BY work_place)
    WHERE sum > 30000
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

  work_place
------------
           2
           3
           4
           5
           6

d)

In [ ]:
result = SQL_coursor.execute(
    '''
    SELECT date, SUM(amount) as common_amount
    FROM LaborActivity
    GROUP BY date
    ORDER BY common_amount DESC
    ''').fetchall()
print(tb(result, headers=get_table_columns()))

date           common_amount
-----------  ---------------
Понедельник               11
Четверг                    9
Суббота                    7
Пятница                    6
Среда                      3